In [1]:
import pandas as pd

In [2]:
dataset={'student':['abc','def','frt'],'admission':[2023,2022,2021]}
demo=pd.DataFrame(dataset)
print(demo)

  student  admission
0     abc       2023
1     def       2022
2     frt       2021

In [4]:
print(pd.__version__)

1.4.2

In [5]:
a=[20,30,40,50]
demo1=pd.Series(a)
print(demo1)

0    20
1    30
2    40
3    50
dtype: int64

In [6]:
demo2=pd.Series(a,index=["m1","m2","m3","m4"])
print(demo2)
print(demo2[2])
print(demo2["m1"])

m1    20
m2    30
m3    40
m4    50
dtype: int64
40
20

In [7]:
marks={"abc":440,"def":220,"ssd":300}
demo2=pd.Series(marks)
print(demo2)
print(demo2["ssd"])

abc    440
def    220
ssd    300
dtype: int64
300

In [8]:
demo3=pd.Series(marks,index=["abc","ssd"])
print(demo3)

abc    440
ssd    300
dtype: int64

In [9]:
data={"product":["chocolate","puff","waffer"],
     "price":[500,600,700]}
dataFr=pd.DataFrame(data)
print(dataFr)

     product  price
0  chocolate    500
1       puff    600
2     waffer    700

In [10]:
print(dataFr.loc[2])

product    waffer
price         700
Name: 2, dtype: object

In [17]:
stmark=pd.read_csv('demo.csv')
print(stmark)

    Rollno     name  totalmark  obtainmark
0        1      Avi        100        50.0
1        2    Harsh        100        55.0
2        3    Kevin        100        45.0
3        4    Keyur        100        55.0
..     ...      ...        ...         ...
5        6  Shubham        100        85.0
6        7  Avinash        100        55.0
7        8    Anshi        100         NaN
8        9    Paras        100        25.0

[9 rows x 4 columns]

In [12]:
print(pd.options.display.max_rows)

60

In [13]:
pd.options.display.max_rows=8
stud_mark=pd.read_csv('demo.csv')
print(stud_mark)

    Rollno     name  totalmark  obtainmark
0        1      Avi        100          50
1        2    Harsh        100          55
2        3    Kevin        100          45
3        4    Keyur        100          55
..     ...      ...        ...         ...
5        6  Shubham        100          85
6        7  Avinash        100          55
7        8    Anshi        100          65
8        9    Paras        100          25

[9 rows x 4 columns]

In [14]:
print(stud_mark.head())

   Rollno   name  totalmark  obtainmark
0       1    Avi        100          50
1       2  Harsh        100          55
2       3  Kevin        100          45
3       4  Keyur        100          55
4       5   Ansh        100          45

In [15]:
print(stud_mark.tail())

   Rollno     name  totalmark  obtainmark
4       5     Ansh        100          45
5       6  Shubham        100          85
6       7  Avinash        100          55
7       8    Anshi        100          65
8       9    Paras        100          25

In [16]:
print(stud_mark.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Rollno      9 non-null      int64
 1   name        9 non-null      object
 2   totalmark   9 non-null      int64
 3   obtainmark  9 non-null      int64
dtypes: int64(3), object(1)
memory usage: 416.0+ bytes
None

In [18]:
stud=stud_mark.dropna()
print(stud)

    Rollno     name  totalmark  obtainmark
0        1      Avi        100          50
1        2    Harsh        100          55
2        3    Kevin        100          45
3        4    Keyur        100          55
..     ...      ...        ...         ...
5        6  Shubham        100          85
6        7  Avinash        100          55
7        8    Anshi        100          65
8        9    Paras        100          25

[9 rows x 4 columns]

In [19]:
fill_stud=stud_mark.fillna(34)
print(fill_stud)

    Rollno     name  totalmark  obtainmark
0        1      Avi        100          50
1        2    Harsh        100          55
2        3    Kevin        100          45
3        4    Keyur        100          55
..     ...      ...        ...         ...
5        6  Shubham        100          85
6        7  Avinash        100          55
7        8    Anshi        100          65
8        9    Paras        100          25

[9 rows x 4 columns]

In [23]:
mean=stud_mark["obtainmark"].mean()
print(mean)

53.333333333333336

In [24]:
stud1=stud_mark["obtainmark"].fillna(555)
print(stud1)

0    50
1    55
2    45
3    55
     ..
5    85
6    55
7    65
8    25
Name: obtainmark, Length: 9, dtype: int64

In [26]:
median=stud_mark["obtainmark"].median()
print(median)

55.0

In [28]:
mode=stud_mark["obtainmark"].mode()
print(mode)

0    55
Name: obtainmark, dtype: int64

In [30]:
stud.columns

Index(['Rollno', 'name', 'totalmark', 'obtainmark'], dtype='object')

In [31]:
print(stud.loc[0:4])

   Rollno   name  totalmark  obtainmark
0       1    Avi        100          50
1       2  Harsh        100          55
2       3  Kevin        100          45
3       4  Keyur        100          55
4       5   Ansh        100          45

In [33]:
stud.sort_values(['obtainmark'],ascending=0) #ascending

    Rollno     name  totalmark  obtainmark
5        6  Shubham        100          85
7        8    Anshi        100          65
1        2    Harsh        100          55
3        4    Keyur        100          55
..     ...      ...        ...         ...
0        1      Avi        100          50
2        3    Kevin        100          45
4        5     Ansh        100          45
8        9    Paras        100          25

[9 rows x 4 columns]

In [34]:
stud.sort_values(['obtainmark'],ascending=1)

    Rollno     name  totalmark  obtainmark
8        9    Paras        100          25
2        3    Kevin        100          45
4        5     Ansh        100          45
0        1      Avi        100          50
..     ...      ...        ...         ...
3        4    Keyur        100          55
6        7  Avinash        100          55
7        8    Anshi        100          65
5        6  Shubham        100          85

[9 rows x 4 columns]

In [35]:
stmark['percentage']=(stmark['obtainmark']/stmark['totalmark'])*100
stmark.head(5)

   Rollno   name  totalmark  obtainmark  percentage
0       1    Avi        100        50.0        50.0
1       2  Harsh        100        55.0        55.0
2       3  Kevin        100        45.0        45.0
3       4  Keyur        100        55.0        55.0
4       5   Ansh        100        45.0        45.0